{"pages":[{"title":"Portfolio","text":"","link":"/blog/Portfolio/index.html"},{"title":"Cheatsheet","text":"TopicsComuter Software Xubuntu(VM) zsh Vim Web Dev HTML/CSS JavaScript React Vue Git TRPGSystems D&amp;D 5e CoC 7th OSR Others Reading Sly Flourish Matt Colville TBDUpdate Memos Date Memo 2021-11-02 Create Cheatsheet page.","link":"/blog/Cheatsheet/index.html"},{"title":"Sub Sheet Test","text":"This is a test for a sub sheet.","link":"/blog/Cheatsheet/sub-sheet-test.html"}],"posts":[{"title":"2021/10/31","text":"There’s something off about this theme that the heading looks not right on mobile devices. Daily NotesI tested some basic markdown features of this theme, Minos. And I changed the theme to “atom-one-dark” for the code block syntax highlighting. I pushed the code of this blog to the main branch of the repo and the page showing to gh-pages branch for Github pages to show. So I can write from different machines and put things up to this blog. I think I did the same thing, making a blog with hexo, a few years ago. This time I should write a note in detail about the process for future reference. Items To Cover Github Pages Hexo Hexo related packages I use Hexo cli commands used regularly Minos Theme Theme install My current settings","link":"/blog/2021/10/31/2021-10-31/"},{"title":"2021/11/01","text":"I will get up early and start a new post every day. The title will be the same as the date. This post will be ongoing written until the day ends. TODO React Doc Reading JavaScript learning plan CSS learing plan TRPG writing Daily blog post (hexo) Memos I still want to try Vim. Vim Using vim to edit HTML/CSS/JS files? I think I need ESline and Prettier plug-in. Create a ‘.vimrc’ file in home folder for current user. Setup backup shell script. vim-plug I wanted to adjust theme of this blog to a darker theme. Need to research on how to do it.","link":"/blog/2021/11/01/2021-11-01/"},{"title":"2021/11/02","text":"I need some kind of template or SOP for my life. TODOReading React Doc Eloquent JavaScript CSS W3C School Examples F2E 2021 Event Material Writing Daily Notes TRPG plurk post Tweet post vocus post Daily Notes 隔天的記事寫前一天的事情？目前 Xubuntu 的 VSCode 還沒搞定中文輸入法，之前有點硬要就都打英文，現在在 Mac 上可以打中文，就還是想打中文。有時候覺得這樣胡亂地寫點東西對自己蠻好的，雖然然我知道這在工程師的方面來說，看起來是不太專業。也許也是因為這樣才會想把作品集跟學習筆記的頁面分開吧。我那乏善可陳的作品集頁面（嘆氣）。 這次我比上次建立這樣的 blog 稍微知道一點點自己在做什麼了。雖然還是用著大部分都不是真的很清楚的東西，但至少不完全只是照抄指令，查詢文件也比較有頭緒了。但是從 Github 還有相關套件的 Repo 看起來，這也是個漸漸已經停止更新的東西。有新的東西出現了，但還不急著跳過去。先練習寫筆記吧。真的有需要的時候再換到新的工具去。 Learn Ruby the Hard Way 我一直都蠻記得這本書的，我以前蠻喜歡他的寫法，他建議的學習方式。（對於完全沒寫過程式的入門者來說，似乎是蠻好的一步一步來的順序。） 用 Vim 來寫網頁好像有點怪，不過總之先把常用的 prettier 與 emmet 的 Vim 工具掛上了。 vim-prettier emmet-vim 至少 Vim 裡面中文輸入是正常的，在 Xubuntu 的 Terminal 可以正常輸入中文但是 VSCode 下沒辦法有待研究。 highlight.js supported languages '.vimrc settings'123456789101112131415161718packloadall\"Set line numberset numberhighlight LineNr ctermfg=grey\"Set autoindentfiletype indent onset shiftwidth=2set tabstop=2set expandtab\"Set syntax highlightingsyntax on\"vim-prettier settinglet g:prettier#autoformat = 1let g:prettier#autoformat_require_pragma = 0 這個部落格的每日筆記這樣寫，整個就超級雜亂像是剪貼簿一樣，但這樣的感覺很不錯。就是亂雜雜地記。但是記得要跟作品集之要展示的東西分開就是了。 朋友問 Git 的問題，我發現很多東西都是一知半解。也許找時間好好讀下官網的書 Pro Git 吧。","link":"/blog/2021/11/02/2021-11-02/"},{"title":"2021/11/03","text":"先不要寫待辦事項好了，如果什麼都沒做有點難看。 用 Terminal 連 ptt ，但是直接用 Telnet 好像已經不建議，安全的連線方式待研究。 連線到 ptt 的 terminal 指令1luit -encoding big5 telnet ptt.cc My friend amos told me to practice writing in English. I will. Set up links in Cheatsheet. Use posts as subsheets.","link":"/blog/2021/11/03/2021-11-03/"},{"title":"2021/11/15","text":"The problem of missing a daily to-do: if you stop one day, you will stop doing it for a long time. Deployed the page I made with React. Although the project is far from finished, I want to upload it the day before its deadline. I have to pick up the habit of starting doing the work earlier and don’t stall for no reason or any reason.","link":"/blog/2021/11/15/2021-11-15/"},{"title":"2021/11/22","text":"Old Parts that WorksThis is the first post with images. I think I will have each post with at least one image from now on. Just upgraded my Desktop PC yesterday, with a few second hand parts I gathered from here and there. A few things to read later, links listed below: Learnging NotesA study group was formed by a few friends, I wrote down something they are reading. Backend, Rails and Webpack https://railsbook.tw/ https://webpack.js.org/concepts/ tailwind css https://tailwindcss.com/docs https://marketplace.visualstudio.com/items?itemName=bradlc.vscode-tailwindcss https://marketplace.visualstudio.com/items?itemName=csstools.postcss https://dev.to/saviomartin/set-up-tailwind-in-react-the-fastest-way-2a4d TODO Portfolio page. Domain name? Memos Sleep, eat, excercise.","link":"/blog/2021/11/22/2021-11-22/"},{"title":"2022-02-21 Mon","text":"放置許久的 blog 測試貼文其實已經不太確定要怎麼用這裡了。技術 stack 也不太對，好像應該要整個重做… 先試用一下，過渡期，等新的好了再調整（也許用 Gatsby 做）。","link":"/blog/2022/02/21/2022-02-21-Mon/"},{"title":"First Post","text":"This is the first post of the blog. I’m going to use this blog to write notes about what I’m learning and my thoughts. I created this blog with hexo. Minos Theme added. I use this set for its simple look and code block syntax highlighting Code Block Example'JavaScrip Example'123456789function fn(n) { let a; if (n &lt; 3) { a = 1; } else { a = fn(n - 1) + fn(n - 2); } return a;}","link":"/blog/2021/10/29/First-Post/"},{"title":"Hexo Test 2021/10/30","text":"I’m testing some features of Hexo. This is a messy post. So be it. TODO A post about my hexo blog setting. Checklist Test Test checkbox syntax. Does this work? (Yes, it works.) This is a checked checkbox. These syntax below does not work.[ ] Checkbox syntax test 2.[x] Checkbox syntax test 3. Something I Tested I did a few tests on this theme. h1 would be the same as title of the page and same size in quotes. I tested generating a draft markdown file by hexo-cli. And tried publishing it by cli. If I don’t want draft documents be pushed to Github repo, I will need to add the file to .gitignore. Removed keybinding for “ctrl+space” of Trigger Suggest in Visual Studio Code in Xubuntu. Fcitx is still not working. Test Markdown h2 sizeI’m not sure how would this look like. This is a Quote h1 in quotesTest markdown. h2 in quotesTest markdown. h3 in quotesTest markdown. Table Test Col 01 Col 02 Test 01 Test 02 Box Col Box Col Content. What would happen if I want to write a lot of things in this one?","link":"/blog/2021/10/30/Hexo-Test-2021-10-30/"},{"title":"The Simpsons for 2021 Me","text":"","link":"/blog/2021/11/15/The-Simpsons-for-2021-Me/"}],"tags":[{"name":"memo","slug":"memo","link":"/blog/tags/memo/"},{"name":"hexo","slug":"hexo","link":"/blog/tags/hexo/"}],"categories":[]}